{
    "title": "Arduino Calculator",
    "link": "https://github.com/YS-RAPTOR/Arduino-Calculator",
    "technologies": [
        "Arduino",
        "C++"
    ],
    "rank": 0,
    "draft": true,
    "demo": "https://wokwi.com/projects/346662749691970131",
    "description": "The BODMAS Calculator is a project that my team(I was the Leader) developed as an assignment for our Embedded Micro Controllers unit. The calculator was made for the Arduino Platform and is specifically designed for the Arduino Mega. The calculator works similarly to a scientific calculator and supports all the basic arithmetic operations such as addition, subtraction, multiplication, and division. In addition to these operations, it also supports brackets, square root, percentages, and negative numbers, making it a versatile tool for complex calculations.\n\nTo make the calculator user-friendly and intuitive, we added a cursor that allows users to edit the expression before evaluating it. The screen used was a 16x2 LCD display and the calculator could handle a maximum of 256 characters for a single expression. The keypad used is a 5x5 multiplexed keypad. The keypad is also interrupt driven that ensures efficient and responsive input handling.\n\nThe BODMAS functionality is implemented by using the Shunting Yard Algorithm which uses the stack data structure for performing BODMAS operations.\n\nTo enhance the functionality of the calculator, we also included memory operations such as memory recall, memory addition, and memory subtraction. The calculator also checks for syntax errors and displays error messages on the LCD screen if an invalid input or expression is detected. Another standout feature of this calculator is the inclusion of a built-in timer, achieved through integration with an RTC (Real-Time Clock) module. This functionality adds versatility to the calculator, making it valuable for students taking in part in examinations and tests.\n\nOverall, the BODMAS Calculator project showcases our team's skills in embedded systems design, programming, and user interface design. It demonstrates our ability to develop complex systems that can handle a variety of inputs and operations while maintaining reliability and accuracy. It also highlights our familiarity with essential tools such as LCD displays, microcontrollers, and programming languages such as C++. This project also highlights my understanding of algorithms and data structures. Moreover, achieving a perfect score of 100% for the assignment underscores my commitment to delivering solutions that excel in both functionality and performance."
}